In [1]:
import sqlite3

In [2]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.0-py3-none-any.whl (19 kB)
Requirement already satisfied: ipython>=1.0 in e:\python data science\lib\site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in e:\python data science\lib\site-packages (from ipython-sql) (0.2.0)
Collecting sqlparse
  Using cached sqlparse-0.4.1-py3-none-any.whl (42 kB)
Requirement already satisfied: six in e:\python data science\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in e:\python data science\lib\site-packages (from ipython-sql) (1.3.20)
Collecting prettytable<1
  Downloading prettytable-0.7.2.tar.bz2 (21 kB)
Requirement already satisfied: setuptools>=18.5 in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (50.3.1.post20201107)
Requirement already satisfied: decorator in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.10 in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: pygments in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (2.7.2)
Requirement already satisfied: colorama; sys_platform == "win32" in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: traitlets>=4.2 in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: backcall in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in e:\python data science\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in e:\python data science\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in e:\python data science\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13705 sha256=cd22961c5c51a8b23a80ca2fbaf5a89f9f9f84fd705580aa8839aa4fc0371f46
  Stored in directory: c:\users\rd\appdata\local\pip\cache\wheels\46\60\6c\bb25d05df22906786206e901e9354bb3061061191116768bee
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.4.1

In [5]:
import pandas as pd

In [15]:
# Load Dataset

df= pd.DataFrame({'CustomerID':['1','2','3','4','5'],
                 'CustomerName':['Chandan','Raunak','alok','Avijeet','Ram'],
                 'City':['Madhubani','Gaya','Nalanda','Burdwan','Siwan'],
                  'Age':['22','24','32','45','24']
                 })
df

  CustomerID CustomerName       City Age
0          1      Chandan  Madhubani  22
1          2       Raunak       Gaya  24
2          3         alok    Nalanda  32
3          4      Avijeet    Burdwan  45
4          5          Ram      Siwan  24

In [17]:
#we will sqlite3 library and create a connection
cnn =sqlite3.connect('jupyter_sql_tutorial.db')

In [29]:
df.to_sql('Customer',cnn)

In [30]:
# Load sql module to ipython
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [31]:
%sql sqlite:///jupyter_sql_tutorial.db

In [32]:
# Print entire dataset
%%sql

SELECT * FROM Customer

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, '1', 'Chandan', 'Madhubani', '22'),
 (1, '2', 'Raunak', 'Gaya', '24'),
 (2, '3', 'alok', 'Nalanda', '32'),
 (3, '4', 'Avijeet', 'Burdwan', '45'),
 (4, '5', 'Ram', 'Siwan', '24')]

In [33]:
# Use count() function
%%sql
SELECT count(*)
FROM Customer

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(5,)]

In [34]:
# Total sum of Any Numeric column
%%sql

SELECT sum(Age) as 'Age_sum'
FROM Customer

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(147,)]

In [36]:
# find Min Value of Any Numeric column
%%sql

SELECT min(Age) as 'Age_sum'
FROM Customer

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('22',)]

In [37]:
# find Max Value of Any Numeric column
%%sql

SELECT max(Age) as 'Age_sum'
FROM Customer

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('45',)]

In [38]:
#Extract Any Prticular Column  from table
%%sql 
SELECT CustomerName, City FROM Customer

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Chandan', 'Madhubani'),
 ('Raunak', 'Gaya'),
 ('alok', 'Nalanda'),
 ('Avijeet', 'Burdwan'),
 ('Ram', 'Siwan')]

In [39]:
#find Distinct No fram table
%%sql

SELECT DISTINCT Age FROM Customer;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('22',), ('24',), ('32',), ('45',)]

In [40]:


%%sql

SELECT count(DISTINCT Age) FROM Customer;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(4,)]

In [41]:
#FInd Specific Data  use where CLAUSE 

%%sql
SELECT * FROM Customer
WHERE CustomerID=1;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, '1', 'Chandan', 'Madhubani', '22')]

In [42]:

%%sql
SELECT * FROM Customer
WHERE CustomerID>1;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, '2', 'Raunak', 'Gaya', '24'),
 (2, '3', 'alok', 'Nalanda', '32'),
 (3, '4', 'Avijeet', 'Burdwan', '45'),
 (4, '5', 'Ram', 'Siwan', '24')]

In [44]:
%%sql
SELECT * FROM Customer
WHERE CustomerID<=1;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, '1', 'Chandan', 'Madhubani', '22')]

In [46]:
%%sql
SELECT * FROM Customer
WHERE CustomerID<>1;  # WHERE CustomerID!=1; Both are same

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, '2', 'Raunak', 'Gaya', '24'),
 (2, '3', 'alok', 'Nalanda', '32'),
 (3, '4', 'Avijeet', 'Burdwan', '45'),
 (4, '5', 'Ram', 'Siwan', '24')]

In [50]:
#FInd BETWEEN values from table
%%sql
SELECT * FROM Customer
WHERE CustomerID between 2 And 4;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, '2', 'Raunak', 'Gaya', '24'),
 (2, '3', 'alok', 'Nalanda', '32'),
 (3, '4', 'Avijeet', 'Burdwan', '45')]

In [63]:
%%sql
SELECT * FROM Customer
WHERE CustomerID LIKE '5'; # use

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(4, '5', 'Ram', 'Siwan', '24')]

In [64]:
# lIKE 'a%' use for Finds any values that start with "a" from TABLE
# same like end with "a" use '%a'
# same like  use '%a%' Finds any values that have "or" in any position
#            use '__r%'      Finds any values that have "r" in the second position
#            use 'a%o'               start with "a" and ends with "o"


%%sql

SELECT * FROM Customer
WHERE CustomerName LIKE 'a%'

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(2, '3', 'alok', 'Nalanda', '32'), (3, '4', 'Avijeet', 'Burdwan', '45')]

In [65]:
# IN operator allows you to specify multiple values in a WHERE clause
%%sql

SELECT * FROM Customer
WHERE City IN ('Madhubani', 'Gaya');

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, '1', 'Chandan', 'Madhubani', '22'), (1, '2', 'Raunak', 'Gaya', '24')]

In [68]:
# select top 3 from table
%%sql

SELECT * FROM Customer LIMIT 3;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, '1', 'Chandan', 'Madhubani', '22'),
 (1, '2', 'Raunak', 'Gaya', '24'),
 (2, '3', 'alok', 'Nalanda', '32')]